- **Input and output typically has a many category : reading files, loading data from the database and interacting with network source api**

# Reading and writing data in text format

In [1]:
import pandas as pd
import numpy as np

1. many feature in panda to operate a files 
2. pandas.read_csv, excel, html, json, sql, sql_table, xml, sas and many more

In [2]:
cd /home/master/Dataanalysis/notes/pydata-book/examples

/home/master/Dataanalysis/notes/pydata-book/examples

/home/master/Dataanalysis/venv/lib/python3.11/site-packages/IPython/core/magics/osm.py:417: UserWarning: This is now an optional IPython functionality, setting dhist requires you to install the `pickleshare` library.
  self.shell.db['dhist'] = compress_dhist(dhist)[-100:]

In [3]:
df = pd.read_csv("ex1.csv")
!cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
#if you have not a name of any column so you set as default columns
pd.read_csv("ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv("ex2.csv", names=["a", "b", "c", "d", "messages"])

   a   b   c   d messages
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [7]:
pd.read_csv("ex2.csv", names=["a", "b", "c", "d", "messages"], index_col="messages")

          a   b   c   d
messages
hello     1   2   3   4
world     5   6   7   8
foo       9  10  11  12

In [8]:
cat csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [9]:
pd.read_csv("csv_mindex.csv", index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [10]:
#if the field is seperated by the whitespaces
pd.read_csv("ex3.txt", sep="\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
#if you want to skip the row so you uses skiprows parameter
!cat ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
pd.read_csv("ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!cat ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [14]:
result = pd.read_csv("ex5.csv")

In [15]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
result1 = pd.read_csv("ex5.csv", na_values=["NULL"])

In [18]:
result1

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.read_csv("ex5.csv", keep_default_na=False).isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [20]:
pd.read_csv("ex5.csv", keep_default_na=False, na_values=["NA"]).isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [21]:
pd.options.display.max_rows = 10

In [22]:
pd.read_csv("ex6.csv")

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [23]:
pd.read_csv("ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

# Writing data to text format

In [24]:
data = pd.read_csv("ex5.csv")

In [25]:
!cat ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [26]:
data.to_csv("out1.csv")   #Write data commans seperated

In [27]:
!cat out1.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [28]:
#other delemeter is used like sys package
import sys
data.to_csv("sys1.stdout", sep="|", na_rep="NULL")

In [29]:
!cat sys1.stdout

|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|foo

In [30]:
data.to_csv("sys2.stdout", na_rep="NULL", index=False, header=False)

In [31]:
!cat sys2.stdout

one,1,2,3.0,4,NULL
two,5,6,NULL,8,world
three,9,10,11.0,12,foo

In [32]:
data.to_csv("sys2.stdout", na_rep="NULL", index=False, columns=["a", "b", "c", "d", "message"])

In [33]:
!cat sys2.stdout

a,b,c,d,message
1,2,3.0,4,NULL
5,6,NULL,8,world
9,10,11.0,12,foo

In [34]:
pd.read_csv("sys2.stdout")

   a   b     c   d message
0  1   2   3.0   4     NaN
1  5   6   NaN   8   world
2  9  10  11.0  12     foo

In [35]:
#other delimited Formats
import csv
f = open("ex7.csv")
reader = csv.reader(f)

In [36]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [37]:
with open("ex7.csv") as f:
    lines = list(csv.reader(f))

In [38]:
header, values = lines[0], lines[1:]

In [39]:
data_dict = {h:v for h, v in zip(header, zip(*values))}

In [40]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [41]:
f = open("ex7.csv")
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

In [42]:
reader

- **Json data**

In [43]:
obj = """
{"name": "Wes",
"cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
"pet": null,
"siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
{"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [44]:
import json
result = json.loads(obj)  #load is used to json convert python normal form

In [45]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [46]:
jsonresult = json.dumps(result) #convert python to json as it back

In [47]:
jsonresult

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [48]:
data = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [49]:
data

    name  age
0  Scott   34
1  Katie   42

In [50]:
data = pd.read_json("example.json")

In [51]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [52]:
#pandas to json
data.to_json("sys.stdout")

In [53]:
sys.stdout

# XML AND HTML WEB SCRAPING

In [54]:
# There are many libraries present in python for reading and writing html and xml formats
# like html5lib, Beautiful soup, lxml
tables = pd.read_html("fdic_failed_bank_list.html")

In [55]:
len(tables)

1

In [56]:
fail = tables[0]

In [57]:
fail.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [58]:
closeDate = pd.to_datetime(fail['Closing Date'])

In [59]:
closeDate.head()

0   2016-09-23
1   2016-08-19
2   2016-05-06
3   2016-04-29
4   2016-03-11
Name: Closing Date, dtype: datetime64[ns]

- # xml file read

In [60]:
from lxml import objectify

In [61]:
cd /home/master/Dataanalysis/notes/pydata-book/datasets

/home/master/Dataanalysis/notes/pydata-book/datasets

/home/master/Dataanalysis/venv/lib/python3.11/site-packages/IPython/core/magics/osm.py:417: UserWarning: This is now an optional IPython functionality, setting dhist requires you to install the `pickleshare` library.
  self.shell.db['dhist'] = compress_dhist(dhist)[-100:]

In [62]:
path = "mta_perf/Performance_MNR.xml"

In [63]:
with open(path) as f:
    parsed = objectify.parse(f)
root = parsed.getroot()
data = []
skip_field = ["PARENT_SEQ", "INDICATOR_SEQ","DESIRED_CHANGE", "DECIMAL_PLACES"]
for elt in root.INDICATOR:
    eltdata = {}
    for child in elt.getchildren():
        if child.tag in skip_field:
            continue
        eltdata[child.tag] = child.pyval
    data.append(eltdata)
xmldata = pd.DataFrame(data)
xmldata.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

- **Above this process we do with single line expression**

In [64]:
data = pd.read_xml(path)

In [65]:
data.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

# Reading Microsoft xml files

In [66]:
cd /home/master/Dataanalysis/notes/pydata-book/examples

/home/master/Dataanalysis/notes/pydata-book/examples

/home/master/Dataanalysis/venv/lib/python3.11/site-packages/IPython/core/magics/osm.py:417: UserWarning: This is now an optional IPython functionality, setting dhist requires you to install the `pickleshare` library.
  self.shell.db['dhist'] = compress_dhist(dhist)[-100:]

In [67]:
xlsx = pd.ExcelFile("ex1.xlsx")

In [68]:
xlsx.sheet_names

['Sheet1']

In [69]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [70]:
frame = pd.read_excel("ex1.xlsx", sheet_name="Sheet1", index_col=0)

In [71]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [72]:
#For writing the excel file use excelWriter 
#writer = pd.ExcelWriter("excel2.xlsx")
#frame.to_excel(writer, "Sheet1")
#to avoid Writer we use to_excel
frame.to_excel("excel2.xlsx")

In [73]:
pd.read_excel("excel2.xlsx", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

1. HDF5 FILE IS USED to store the scientific values as array .
2. The extension is .h5
3. pd.read_hdf("file_name", "obj3", where=["index < 5"])

# Interacting with web api

In [75]:
import requests

In [86]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [87]:
request = requests.get(url)

In [88]:
request.raise_for_status()

In [89]:
request

In [90]:
data = request.json()

In [94]:
pd.DataFrame(data).head()

,url,repository_url,labels_url,comments_url,events_url,html_url,id,node_id,number,title,...,author_association,active_lock_reason,draft,pull_request,body,closed_by,reactions,timeline_url,performed_via_github_app,state_reason
0,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/59819,2528346526,PR_kwDOAA0YD857nWvp,59819,BLD/RLS: build wheels with released numpy/cyth...,...,MEMBER,None,False,{'url': 'https://api.github.com/repos/pandas-d...,Now that there is a released numpy that suppor...,None,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,None,None
1,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/59818,2528099132,PR_kwDOAA0YD857mhZk,59818,BUG: Remove np._get_promotion_state usage,...,CONTRIBUTOR,None,False,{'url': 'https://api.github.com/repos/pandas-d...,- [x] closes #59817 \r\n- [x] [Tests added and...,None,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,None,None
2,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/59817,2527931881,I_kwDOAA0YD86WrS3p,59817,No Python 3.13 wheels available in scientific-...,...,CONTRIBUTOR,None,NaN,NaN,Python 3.13 wheels have been failing for ~5 da...,None,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,None,None
3,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/59816,2527831932,PR_kwDOAA0YD857loD3,59816,Bump pypa/cibuildwheel from 2.20.0 to 2.21.0,...,CONTRIBUTOR,None,False,{'url': 'https://api.github.com/repos/pandas-d...,Bumps [pypa/cibuildwheel](https://github.com/p...,None,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,None,None
4,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/59815,2527564461,PR_kwDOAA0YD857kvzq,59815,BUG: read_json silently ignores the dtype when...,...,CONTRIBUTOR,None,False,{'url': 'https://api.github.com/repos/pandas-d...,- [x] closes #59516 (Replace xxxx with the Gi...,None,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas...,None,None

In [95]:
data[0]["title"]

'BLD/RLS: build wheels with released numpy/cython for Python 3.13'